# ViewSolarstudyMultidayFrameText Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSolarstudyMultidayFrameText Property
ParameterTypeId Class See Also
---
"Multi-day frame text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSolarstudyMultidayFrameText { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSolarstudyMultidayFrameText As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSolarstudyMultidayFrameText {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace